#include<stdio.h>
int main()
{                  //（行指针包括列指针，行指针真的范围比较广）
	int a[3][4]={{1,3,5,7},{9,11,13,15},{17,19,21,13}};
	printf("%d %d\n",a,*a);   //0行首地址，0行0列元素地址 
	printf("%d %d\n",a[0],*(a+0));   //0行0列元素地址，0行0列元素地址
	printf("%d %d\n",&a[0],&a[0][0]);   //0行首地址，0行0列元素地址
	printf("%d %d\n",a[1],a+1);    //1行0列地址，1行首地址
	printf("%d %d\n",&a[1][0],*(a+1)+0);   //1行0列元素地址，1行0列元素地址
	printf("%d %d\n",a[2],*(a+2));   //2行0列地址，2行0列地址
	printf("%d %d\n",&a[2],a+2);  //2行首地址，2行首地址
	printf("%d %d\n",a[1][0],*(*(a+1)+0));  //1行0列元素值（内容），1行0列元素值（内容）
	printf("%d %d %d\n",*a[2],*(*(a+2)+0),(*(a+2)[0]));  //2行0列元素值（内容），2行0列元素地址值（内容）
	return 0;
}